{
	"name" : "Renjith P. Narayanan",
	"contact" : "renjith2002@gmail.com",
	"title" : "Sr. Front End Engineer",
	"objective" : "Looking for a long term association with an organization where individual talents, skills and hard work are acknowledged and to be a valued asset in the organization",
	"aboutme" : "I'm a senior software engineer with a particular interest in web technologies (esp. JavaScript,react.js,backbone.js and node.js). I also do lots of work in react, and formerly Java, and also other languages. I've been doing this professionally for >7 years.",
	"social" : [
		{
			"link" : "http://www.linkedin.com/in/renjith-pn",
			"name" : "LinkedIn"
		},
		{
			"link" : "https://twitter.com/renjithpn",
			"name" : "twitter"
		},
		{
			"link" : "https://github.com/renjithpn",
			"name" : "Git Hub"
		},
		{
			"link" : "http://stackoverflow.com/users/590498/renjith-p-n?tab=profile",
			"name" : "Stack Overflow"
		}
	],
	"skills" : [
		"JavaScript",
		"JSX",
		"HTML",
		"CSS",
		"Core Java",
		"JavaEE",
		"Java Swing",
		"Apache",
		"Adobe Analytics",
		"JSP",
		"REST API",
		"JSON",
		"Jboss4.5",
		"GIT",
		"SVN",
		"JIRA",
                "Agile Development"
	],
	"frameworks" : [
		"React.js",
		"Redux",
		"Webpack",
		"Jest",
		"Enzyme",
		"Backbone.js",
		"Underscore.js",
		"requireJS",
		"JQuery"
	],
	"projects" : [
		{
			"name" : "ASDA.com UK",
			"technologies" : "React,Redux, NodeJs, Jest, Enzyme, Webpack, Apache",
			"description" : "Developed the asda.com single page progressive webapplication using the React, Redux as frontframe work and used Endeca XM as cms"
		},
		
		{
			"name" : "WAL-MART MEXICO",
			"technologies" : "Java/J2ee, ATG, Oracle DB, SQL, Jboss4.5.",
			"description" : "This project is to build a brand new webapplication for the Walmart Mexico groceries site, I was mainly involved in building the account related REST apis  ."
		},

		{
			"name" : "WAL-MART UK GROCERIES",
			"technologies" : "Java/J2ee, ATG, JavaScript, JQuery, Backbone.js, Oracle DB, Jboss4.5.",
			"description" : "UKGE is a project to enhance E-commerce Platform for Wal-Mart’s UK subsidiary ASDA. This project is an application development project starting with requirements gathering, application design, application development, testing, implementation and post implementation support. ASDA Groceries E-commerce Site (Green Isle), the site redesign project involves movement of the existing site to an extremely new responsive design to enhance online shopping that suits for wide range of devices."
		},
		
		
		{
			"name" : "DATAMIGRATION FRAMEWORK",
			"technologies" : "CoreJava, Java Swing, Oracle DB.",
			"description" : "This Project objective is to migrate the network details for Telecom service providers from excel source to Oracle database using the DMF Framework. This framework helps the customer to maintain the database accurate with real-time network. The data which we migrated consists of many attributes like Locations, Equipment, Connections, and Circuits in metasolv database. This tool can migrate data of various telecom technologies like SDH, MPLS and WIMAX."
		},
		
		{
			"name" : "MOBILE NUMBER PORTABILITY",
			"technologies" : "CoreJava, Java EE 6, Jsp, Javascript, Oracle DB ,web logic.",
			"description" : "Mobile Number Portability is a process that enable subscriber to keep their number when they move between the service providers. Regulatory organization mandate that MNP is good for consumers as it eliminates a core barrier for number ownership for them"
		},
		
		{
			"name" : "OSSF WEBSITE ",
			"technologies" : "Design, development, UI, HTML, CSS, JQuery, user testing.",
			"description" : "I developed this web application from the ground up to showcase the different products developed by the OSS Factory team to the customer. I have developed all of the code for this website, which includes:  JQuery, Javascript, HTML and CSS3. And   integrated this web application with the SharePoint application and developed different search options also."
		}
		
	],
	"experience" : [
		{
			"company" : "Wipro Technologies",
			"link" : "",
			"title" : "Senior Software Engineer",
			"startDate" : "2011",
			"endDate" : "Present",
			"responsibilities" : "Experience in turning concepts and requirements into highly available web applications and systems using industry standard languages and technologies such as JavaScript, Java , ReactJS, BackboneJS, Oracle, ATG. Experience with agile engineering practices including Continuous Integration, Test driven development and opportunistic refactoring,Experience interacting with RESTful APIs from web applications. Personal drive to stay updated with the latest web application technology trends and practices, Experience in working with Product Owners to propose, analyse and negotiate business requirements, and translate them into technical requirements. Deliver software solutions to specification and on-schedule that are fit for purpose.Experience in analyzing  functional and non-functional requirements to determine impact on technical systems.",
			"achievements" : "Introduced unit testing, continuous integration, source control, and development best practices to the team.  Started the Lunch and Learn program where team members teach each other new technologies and techniques. Lead development teams of up to 5 developers on profitable development projects."
		}
	],
	
	"education" : [
		{
			"college" : "M A College of Engineering , Kothamangalam",
			"startDate" : "2007",
			"endDate" : "2010",
			"program" : "Master of Computer Application",
			"achievements" : "70.5%."
		},
		{
			"college" : "St. Thomas College Palai.",
			"startDate" : "2004",
			"endDate" : "2007",
			"program" : "BSc. Physics",
			"achievements" : "80.9%."
		}
	
	]
}
